<template>
  <div>
    <UiPageTitle as="h2" title="コミュニティ概要" />

    <h3>もふもふ広場について</h3>
    <p>
      もふもふ広場はくまモフさんのファンが集うマイクラマルチプレイサーバーです!
    </p>
    <p>
      マルチプレイをまったり楽しみながら、
      みんなで気軽に交流できる活発なコミュニティです!
      初めての方も気軽にお越しください。
    </p>
    <p>
      統合版・JAVA版のどちらでも参加できます!
      ルールを守って楽しく過ごしましょう♪
      参加したい方はトップページの招待バナーをクリックしてDiscordサーバーにご参加ください!
    </p>

    <h3>沿革</h3>
    <ul>
      <li>
        2025.12 旧親衛隊鯖 設立 くまモフさんを交えて春祭り、夏祭り等を開催
      </li>
      <li>
        2026.09 サーバー新設 運営の交代により名前を もふもふ広場
        に改めサーバーを新設する
      </li>
    </ul>
  </div>
</template>
