<template>
  <div>
    <UiPageTitle as="h2" title="運営思想・方針・ルールについて" />
    <h3>運営における基本思想</h3>
    <p>
      参加者がお互いに好きなプレイをできるような環境を目指す。<br />
      サーバー自体はJavaであるため、Java環境を基本として運営を行うが、統合版との差が大きくならないよう努力を行う。
    </p>
    <h3>運営方針</h3>
    <h4>方針1</h4>
    <p>他者のプレイを阻害するような行為はご遠慮頂く。</p>
    <h4>方針2</h4>
    <p>
      バニラ環境のサバイバルモードで本来必要な、不可逆のコストを省く挙動を行う行為はご遠慮頂く。
    </p>
    <h4>方針3</h4>
    <p>
      運営開始後当面の間は、バニラ環境のサバイバルモードで根本的に再現不可能な挙動を行う行為はご遠慮頂く。
    </p>
    <h4>方針4</h4>
    <p>建築は外部からの景観にも配慮して頂く。</p>
    <h4>その他方針</h4>
    <p>公序良俗に反する行為はご遠慮頂く。</p>
    <h3>ルール</h3>
    <h4>第1節: 迷惑行為の防止に関する条項</h4>
    <h5>第1条 (盗難行為)</h5>
    <p>
      盗難行為を禁止する。アイテムや資源は必ず双方合意の上でやり取りするものとする。
    </p>
    <h5>第2条 (スパム行為)</h5>
    <p>
      Minecraftサーバー内及びDiscordサーバー内でのあらゆるスパム行為を禁止する。<br />
      過度な連投行為及び執拗な発言行為もスパムとみなすことがある。
    </p>
    <h5>第3条 (宗教・政治団体に関する活動)</h5>
    <p>
      実在の宗教及び政治団体等に関する活動を禁止する。<br />
      活動には勧誘・主張の強制・宣伝を含む。
    </p>
    <h5>第4条 (サーバーへの負荷)</h5>
    <p>意図的にサーバーに負荷をかける行為を禁止する。</p>
    <h5>第5条 (PvP)</h5>
    <p>
      合意無くPvPを行うことを禁止する。<br />
      PvPを行う際は双方合意の上で、合意済みであることを現在参加中のプレイヤーに誤解なく周知した上で行う。
    </p>
    <h5>第6条 (その他不適切な行為)</h5>
    <p>その他運営が不適切と判断した場合はその行為を禁止とすることがある。</p>
    <h4>第2節: ゲームバランスへの影響に関する条項</h4>
    <h5>第1条 (暗視機能)</h5>
    <p>Mod、リソースパック及び外部ツールによる暗視機能を禁止する。</p>
    <h5>第2条 (飛行機能)</h5>
    <p>Mod及び外部ツールによる飛行機能を禁止する。</p>
    <h5>第3条 (X-Ray行為)</h5>
    <p>Mod、リソースパック及び外部ツールによるX-Ray行為を禁止する。</p>
    <h5>第4条 (その他不適切なMod等)</h5>
    <p>
      その他運営が不適切と判断した場合はそのMod、リソースパック及び外部ツールを禁止とすることがある。
    </p>
    <h4>第3節: 建築及び景観に関する条項</h4>
    <h5>第1条 (用語)</h5>
    <ul>
      <li>
        1: 建築物<br />
        この節における建築物とは、単一または複数のブロックからなる人工物で、周囲の地形と容易に判別でき、また客観的に見て建築物としての価値を有すると認められるものを指す。
      </li>
      <li>
        2: 人工地形<br />
        この節における人工地形とは、単一または複数ブロックからなる人工物で、自然生成された周囲の地形とは容易に判別不可能なものを指す。
      </li>
      <li>
        3: 領地<br />
        このコミュニティにおける領地とは、運営所定の方式により申請し運営により承認された土地領域を指す。自領地とは、自身が申請し承認された、自身の保有する領地を指す。<br />
        申請の方式、認定の基準については別途定める。
      </li>
    </ul>
    <h5>第2条 (人工物の放置)</h5>
    <p>
      第1条の建築物及び人工地形いずれにも該当しない人工物をメインワールド内で放置する行為を禁止する。<br />
      作成者は、その人工物を早期に撤去するか、建築物あるいは人工地形へと早期に置き換える努力義務を負うものとする。
    </p>
    <h5>第3条 (領地外の設置・破壊)</h5>
    <p>
      メインワールド内において、自領地内あるいは運営の認可する共同建築エリア外での一切の人工物の設置及び破壊行為を禁止する。
      ただし、個別に運営が認めた場合はこの限りではない。
    </p>
    <h5>第4条 (領地外の建築規模)</h5>
    <p>
      自領地外において、建築物に外接する直方体の幅・奥行・高さの合計が100を超える建築を禁止する。<br />
      建築物が斜め建築のみで構成される場合は、当該直方体の幅及び奥行の合計を0.75倍した値に高さを加え、その値を本条における幅・奥行・高さの合計として扱う。<br />
      ただし、その内容から当該位置に建築することに合理性があり、かつその規模が妥当であるとして、運営が事前に判断したものについてはこの限りではない。
    </p>
    <h5>第5条 (地形の改変)</h5>
    <p>
      メインワールド内において、自然生成された地形から大きくかけ離れるほどの地形の破壊行為及び人工地形の作成を禁止する。<br />
      ただし、その内容から見て当該位置にて行うことに合理性があり、かつその地形の改変が必要不可欠であるとして、運営が事前に判断したものについてはこの限りではない。
    </p>
    <h5>第6条 (他者の建築物の破壊・改変)</h5>
    <p>
      自領地外における他者の建築物を無断で破壊・改変する行為を禁止する。<br />
      建築物を作成した本人、または運営が正当だと判断する代理人に同意を取った場合はこの限りではない。
    </p>
    <h5>第7条 (領地境界における建築制限)</h5>
    <p>
      自領地において、他領地及び共同建築エリアとの境界32ブロックにおける建築物は、地面から20ブロックまたは隣接する地形のうち高い方を超えることを禁止する。<br />
      ただし、双方の領地保有者が事前に合意した場合はこの限りではない。
    </p>
    <h5>第8条 (境界制限の適用条件)</h5>
    <p>
      建築に着手した時点においてどの領地とも隣接していなかった境界については、前条のルールを適用しないものとする。<br />
      また、領地取得時点で、隣接する他領地の境界に前条の規定に抵触する建築が着手済みまたは完了済みである場合は、合意の上で領地を取得したものとみなす。
    </p>
    <h4>第4節: 企業制度について</h4>
    <h5>第1条 (横断的活動の制限)</h5>
    <p>
      原則として、複数参加者間あるいは複数領地間を横断して、単独あるいは集団での継続的な活動を行うことを禁止とする。<br />
      ただし、後述する企業についてはその限りではない。
    </p>
    <h5>第2条 (企業の設立)</h5>
    <p>
      参加者は、運営の定める形式にて企業設立の申請を行い、これが運営によって承認された場合、企業を設立することができる。<br />
      企業の活動内容は自由とするが、第4条に定めるインフラに関する活動については別途制限を設けるものとする。
    </p>
    <h5>第3条 (企業代表者)</h5>
    <p>
      企業に所属する人数は問わないが、必ず代表者を設けるものとし、企業代表者は運営からの連絡に応じる努力義務を負うものとする。
    </p>
    <h5>第4条 (インフラ事業の制限)</h5>
    <p>
      領地間を跨ぐ、道の整備・トロッコ鉄道の整備・航路の整備、及び大規模な装置の建築は、インフラ事業として企業による活動を原則禁止する。<br />
      当該事業を行う企業は運営が直接管理し、運営直轄の公営企業としてこれを区別する。
    </p>
    <h5>第5条 (企業による建築)</h5>
    <p>
      企業による活動において建築を行う場合、建築を行う領地保有者の合意を必須とする。<br />
      ただし、領地取得時点で、当該建築が既に着手済みあるいは完了済みである場合は、合意の上で領地を取得したものとみなす。
    </p>
    <h5>第6条 (企業建築物の保護)</h5>
    <p>
      自領地内であっても、企業による建築物を破壊・改変する行為は原則として禁止する。<br />
      ただし、建築物を作成した企業、または運営が正当だと判断する代理人の同意を得た場合はこの限りではない。<br />
      企業代表者は、必要に応じて当該領地保有者からの相談に応じる努力義務を負うものとする。
    </p>
    <h5>第7条 (建築計画の変更)</h5>
    <p>
      企業による建築の計画が変更となった場合、変更となった建築を行う領地保有者と同意を取りなおすことを必須とする。<br />
      既に着手した建築の計画を変更する場合であって、着手時と領地の保有状況に変更がある場合、変更後の領地保有状況に応じて新たに同意を取りなおすこととする。
    </p>
    <h5>第8条 (運営による代理判断)</h5>
    <p>
      企業代表者が運営または各相談者の相談に応じる努力義務を怠っていると運営が判断した場合、運営が代理判断を行うことがある。<br />
      この代理判断について企業はこの結果を拒否することができない。
    </p>
    <h4>第5節: 領地</h4>
    <h5>第1条 (規程への同意)</h5>
    <p>本節に定める、及びWeb上の方式による領地の申請は、本規程に同意して行ったものとみなす。</p>
    <h5>第2条 (領地の申請)</h5>
    <p>領地の申請は、運営の定める方式により行う。</p>
    <h5>第3条 (領地の対象)</h5>
    <p>全て領地は、既にいかなる領地にも属していない場所について申請し、取得できる。</p>
    <h5>第4条 (領地申請の規模)</h5>
    <p>同時に申請可能な領地の面積は10万ブロックとする。なお、同時に複数の領地を申請し、または既に申請している領地の承認を待つ間に新たに申請する場合には、これら全てを合算する。</p>
    <h5>第5条 (領地の承認)</h5>
    <p>申請した領地の承認にあたっては、申請の種類によってそれぞれ以下を考慮する。</p>
    <ul>
      <li>1: (第一領地の新規取得)<br />領地を持たない者が新たに領地を申請した場合には、申請した領地の規模、提出された開発構想、その他開発の見込み等を考慮する。</li>
      <li>2: (既存領地の拡張)<br />既に所有している領地の拡張を申請した場合には、拡張しようとする領地の開発度、その他開発の見込み等を考慮する。</li>
      <li>3: (新規領地の取得)<br />既に領地を有する者が新たに領地を申請した場合には、既に所有する領地の開発度、申請領地の開発構想に対する面積、その他開発の見込み等を考慮する。</li>
    </ul>
    <h5>第6条 (開発度)</h5>
    <p>開発度の認定にあたっては、建築物・人工地形等の整備具合、装置等を設置している場合には当該装置の規模、当初の開発計画に対する達成度、その他領地の状況を総合的に考慮する。</p>
    <h5>第7条 (領地の認定)</h5>
    <p>領地の申請が承認された場合には、申請を行った時点から領地であったものとみなす。</p>
    <h5>第8条 (企業による領地の所有及び申請)</h5>
    <p>領地は個人の他、企業も所有することができる。なお、領地を申請した企業の代表者について、申請中の当該企業の領地の面積を、第4条の面積に合算する。</p>
    <h5>第9条 (企業領地の申請等に関する規程)</h5>
    <p>企業の領地の申請、承認等について、本節第1条から第7条の規程を準用する。</p>
  </div>
</template>
